[
  {
    "Index": "4",
    "Description": "You enter your office, and sit down by your desk. You place the wand in front of you, looking wide-eyed at it. You have never felt the precence of such a powerful object before.",
    "Options": [
      {
        "Index": 1,
        "Name": "Pick up the wand"
      }
    ]
  },
  {
    "Index": "4.1",
    "Description": "The broken part is barely hanging on by a few thing, black, threads. You trace the shape of the wand, over the small spheres that are disturbing the, otherwise ordinarily looking, straight wand-shape.",
    "Options": [
      {
        "Index": 1,
        "Name": "Look for information in the library"
      },
      {
        "Index": 2,
        "Name": "Ask the Charms professor for help"
      }
    ]
  },
  {
    "Index": "4.1.1",
    "Description": "You hide the wand in your office and head towards the library. Witch section should you go to for answers?",
    "Options": [
      {
        "Index": 1,
        "Name": "Magical Creatures"
      },
      {
        "Index": 2,
        "Name": "Herbology"
      }
    ]
  },
  {
    "Index": "4.1.1.1",
    "Description": "You read several books in the Magical Creatures section without luck, until you come across a chapter about thestrals. Something about their hair looks familiar.",
    "Options": [
      {
        "Index": 1,
        "Name": "Read the chapter"
      }
    ]
  },
  {
    "Index": "4.1.1.1.1",
    "Description": "You find out that thestral tail hairs have been, though rarely, used as cores in wandmaking. Although, a wand with such core would only be mastered by a wielder capable of accepting death."
  },

  {
    "Index": "4.1.1.2",
    "Description": "You read several books in the Herbology section without luck, until you come across a chapter about elderwood. You glance over a picture of it, and the hue looks familiar.",
    "Options": [
      {
        "Index": 1,
        "Name": "Read the chapter"
      }
    ]
  },
  {
    "Index": "4.1.1.2.1",
    "Description": "You find out that elderwood is the rarest wand wood, and that it is known to only choose a highly unusual person as their wielder."
  },

  {
    "Index": "4.1.2",
    "Description": "You put the wand in your robe again and head towards Mrs Malfoys office. You knock on the door and she greets you when you enter the room.",
    "Options": [
      {
        "Index": 1,
        "Name": "Show her the wand"
      },
      {
        "Index": 2,
        "Name": "Ask about the wand, without revealiing you have it"
      }
    ]
  },
  {
    "Index": "4.1.2.1",
    "Description": "You carefully pull the wand out of your robe, and hold it out towards Mrs Malfoy. She gasps and stands up from her chair. She starts reaching for the wand, but right before she touches it, she takes a quick step back. She looks terrified.",
    "Options": [
      {
        "Index": 1,
        "Name": "Ask her what she knows"
      }
    ]
  },
  {
    "Index": "4.1.2.1.1",
    "Description": "She hesitates, then gives you a shocked look. She asks you, if you don't know.",
    "Options": [
      {
        "Index": 1,
        "Name": "Know what?"
      }
    ]
  },
  {
    "Index": "4.1.2.1.1.1",
    "Description": "She tells you that you should leave, and the wand that you have in your hand..."
  },

  {
    "Index": "4.1.2.2",
    "Description": "You tell her about a lost wand, and it being broken. You describe the shape and color, and the hair-like core. Mrs Malfoy gives you a suspicious look, and she wonders why you are asking about this wand.",
    "Options": [
      {
        "Index": 1,
        "Name": "Tell her you found it"
      },
      {
        "Index": 2,
        "Name": "Tell her you read about it somewhere"
      }
    ]
  },
  {
    "Index": "4.1.2.2.1",
    "Description": "She laughs, and tells you that's impossible. That the wand you're describing, it belonged to some of the most powerful wizards to ever live, and that it had been broken and lost many years ago.",
    "Options": [
      {
        "Index": 1,
        "Name": "Ask her to tell you more"
      }
    ]
  },
  {
    "Index": "4.1.2.2.1.1",
    "Description": "."
  }
]